{
    "version": "https://jsonfeed.org/version/1",
    "title": "The MudTown Crew",
    "description": "",
    "home_page_url": "https://mudtowncrew.com",
    "feed_url": "https://mudtowncrew.com/feed.json",
    "user_comment": "",
    "icon": "https://mudtowncrew.com/media/website/logoweb.png",
    "author": {
        "name": "Federico Dib"
    },
    "items": [
        {
            "id": "https://mudtowncrew.com/the-mudtown-crew.html",
            "url": "https://mudtowncrew.com/the-mudtown-crew.html",
            "title": "What is this thing?",
            "summary": "What is this MudTown thing you speak of?The MudTown Crew is a comic book / graphic novel series.It's still a work in progress, but soon we'll be releasing issue #0 into the wild. It will initially consist of 5 to 6 issues, and hopefully we'll&hellip;",
            "content_html": "<h2>What is this MudTown thing you speak of?</h2>\n<blockquote>\n<h4 class=\"align-left\"><em>The MudTown Crew is a comic book / graphic novel series.</em></h4>\n</blockquote>\n<p>It's still a work in progress, but soon we'll be releasing <span style=\"text-decoration: underline;\">issue #0</span> into the wild.  <br>It will initially consist of 5 to 6 issues, and hopefully we'll manage to release a few more issues </p>\n<h3>But what is it about?</h3>\n<p>We are very glad you asked...  Keep reading to know more about the adventures of the MudTown Crew.  We'll try to explain who are they? where are they? when are they? what's going on? we don't understand? what the...? </p>\n<p> </p>\n<h3 class=\"align-center\">Planet Earth <br><span style=\"font-size: 16px;\">Year 2380 D.C.</span></h3>\n<p>More than a century has gone by since humankind threw itself into apocalypse-extinction-mode.</p>\n<p>In the midst of a severe climate change disaster we decided it was a good idea to start the <a href=\"https://mudtowncrew.com/the-great-stupid-wars.html\">*Great Stupid Wars*</a>, and right about when we thought it couldn't get any worse, that one huge toxic meteor crashed into the planet and poisoned most of the land and waters.   <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">Because at that point the universe probably thought: <em>\"why the fuck not, I've had enough of this pest\".</em></span></p>\n<p>Yet, somehow humans are still roaming the planet.</p>\n<p>Moreover, like an acne ridden face, pockets of pseudo-civilization are starting to show their ugly head in many places… and so it starts again. And so it appears we didn’t learn a damn thing.</p>\n<p>One of these places is in trouble... actually, all places are in trouble, but we can't be everywhere. So we'll have to follow the story of a small group of inhabitants of this one specific village built on the roof tops of a former city, now renamed as “MudTown”, because... well. It has a lot of mud. <br><br>MudTown’s resources are critically scarce, their taxes are due, and the bully neighboring half-assed kingdom is threatening with a hostile takeover. And by hostile they probably mean: raping, slaughtering and scorching the already scorched land to rule over it's ashes. That kind of hostile.</p>\n<p>MudTown's only hope for survival is to set a small group of common folks with the responsibility of departing to the unknown to save them all. The odds are not good. </p>\n<p>This band of ill-prepared and ill-fitting group, will board their hot-air balloon-airplane hybrid contraption and sail the seven skies in search of the <em><strong>Great New New York</strong>, </em>or... whatever place or situation they can find to help save their townsfolk. They are desperate so they don't get to be picky.</p>\n<p>But they'll sure aim for <strong><em>Great New New York</em></strong>, a place that is said to have electricity, clean waters and even a movie theater with all the classics like the whole Fast &amp; Furious franchise, Back to the Future part 3 and one of those Transformer movies.</p>\n<p>In their travels, they will find many adventures filled with friends and foes. Mostly foes though.<br>They will gain knowledge and experience... and stress, bodily injuries, pain, athletes foot, sunburns, mutant-zombie bites and blisters.</p>\n<p>They will grow as individuals and as a group. They will awe and laugh at what this new wonderful world has to offer. <br>They will also hate each other, fight, scream, curse and vomit in disgust at what this undeadly world throws at them.</p>\n<p>On this adventure they will encounter and fight tyrants, pirates, mutants, cannibals, monsters and communists. <br><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">They will also fight regular folks, gravity, mosquitoes, neo-feudalist lords, evil capitalists, all sorts of </span><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">fanatics, police and probably some giant cockroaches<strong>*</strong>.</span></p>\n<p>It won't be easy to save their people from impending doom, but we will try to have fun watching them try, fail and succeed. Mostly fail though.</p>\n<pre><br><span style=\"color: #100ea4;\"><em>*<strong>Note to self:</strong> Add giant cockroaches all over the place**.</em></span><br><span style=\"color: #ba372a;\"><em><strong>**Note from editor: </strong>Just... NO! leave the cockroaches out!***</em></span><br><span style=\"color: #100ea4;\"><strong><em>**Note to editor: :-(</em></strong></span></pre>",
            "image": "https://mudtowncrew.com/media/posts/2/P4.jpg",
            "author": {
                "name": "Federico Dib"
            },
            "tags": [
            ],
            "date_published": "2020-08-14T00:23:37-06:00",
            "date_modified": "2020-08-14T00:23:37-06:00"
        },
        {
            "id": "https://mudtowncrew.com/who-is-making-this-why.html",
            "url": "https://mudtowncrew.com/who-is-making-this-why.html",
            "title": "Who is making this? why?",
            "summary": "So you might be curious about who is making this? Well, these two are the ones to blame: FJ Dib is a inter-dimensional time traveler that came here to warn us about impending doom. But his time-travel-inter-dimensional spaceship broke down and crashed a few years too&hellip;",
            "content_html": "<h2>So you might be curious about who is making this? </h2>\n<h4><strong>Well, these two are the ones to blame:</strong></h4>\n<p> </p>\n<h3>FJ Dib (writer)</h3>\n<figure class=\"post__image post__image--left\"><img loading=\"lazy\"  src=\"https://mudtowncrew.com/media/posts/3/avataaars.png\" sizes=\"(min-width: 61.3125em) 50vw, 100vw\" srcset=\"https://mudtowncrew.com/media/posts/3/responsive/avataaars-xs.png 300w ,https://mudtowncrew.com/media/posts/3/responsive/avataaars-sm.png 480w ,https://mudtowncrew.com/media/posts/3/responsive/avataaars-md.png 768w\"  alt=\"FJ Dib is scared\" width=\"200\" height=\"200\"></figure>\n<p><span style=\"text-decoration: underline;\">FJ Dib</span> is a inter-dimensional time traveler that came here to warn us about impending doom. But his time-travel-inter-dimensional spaceship broke down and crashed a few years too early in the wrong continent.</p>\n<p>As a consequence of the accident, <span style=\"text-decoration: underline;\">FJ</span> got amnesia, so now he doesn't remember what it is that he was supposed to warn us about.</p>\n<p>In the meantime he writes stuff in the hope that his memory will come back in one of his stories, and thus humanity can be saved. <br><br>He also does non-transcendental programming work stuff to feed and shelter him and his family.</p>\n<h3><br>Jorge Gaboto Hirosh (artist)</h3>\n<figure class=\"post__image post__image--right\"><img loading=\"lazy\"  src=\"https://mudtowncrew.com/media/posts/3/jorgegabotto-2.jpg\" sizes=\"(min-width: 61.3125em) 50vw, 100vw\" srcset=\"https://mudtowncrew.com/media/posts/3/responsive/jorgegabotto-2-xs.jpg 300w ,https://mudtowncrew.com/media/posts/3/responsive/jorgegabotto-2-sm.jpg 480w ,https://mudtowncrew.com/media/posts/3/responsive/jorgegabotto-2-md.jpg 768w\"  alt=\"Hiorsh is the artist. A pretty good one\" width=\"200\" height=\"200\"></figure>My name is Jorge Luis Gabotto, or Hiorsh, born June 4th in 1972.   I am a cartoonist and writer from Mar del Plata, Buenos Aires, Argentina.</p>\n<p>I've always liked to narrate, and I did it whenever I had a chance, from telling a movie, singing a song or just telling a joke.</p>\n<p>The comic, for me, is the concretion of many arts together, a stylistic summit that combines several languages for the narrative. The comic is drawing, evocative plastic expression of techniques such as perspective, color management, human figure, and so on. And the comic is literature, narrative, climates, tensions and beauty in words. The comic, is cinema, is movement, are lights and cameras playing roles from the reader-spectator complicity. It is many things.</p>\n<p> </p>\n<h2>Why are they doing this?</h2>\n<p>That's a very good question. Isn't it? </p>",
            "image": "https://mudtowncrew.com/media/posts/3/pp5.jpg",
            "author": {
                "name": "Federico Dib"
            },
            "tags": [
            ],
            "date_published": "2020-08-14T00:23:37-06:00",
            "date_modified": "2020-08-14T00:23:37-06:00"
        },
        {
            "id": "https://mudtowncrew.com/the-great-stupid-wars.html",
            "url": "https://mudtowncrew.com/the-great-stupid-wars.html",
            "title": "The Great Stupid Wars",
            "summary": "The Great Stupid Wars? 🤨 TL/DR:The Great Stupid Wars where a series of conflicts, mostly violent, that occurred all over the world almost simultaneously, and that triggered a chain of events that set humanity on the path to apocalyptic extinction. There was also a toxic&hellip;",
            "content_html": "<h2>The Great Stupid Wars? 🤨</h2>\n<h3><br>TL/DR:</h3>\n<blockquote>\n<p class=\"align-left\">The Great Stupid Wars where a series of conflicts, mostly violent, that occurred all over the world almost simultaneously, and that triggered a chain of events that set humanity on the path to apocalyptic extinction.  There was also a toxic meteorite. But that was just the the cherry on the cake; The universe hat trick to finish us off.  </p>\n<p class=\"align-left\">It's called stupid, because unlike traditional wars based on classic evil motivations like god ole'e greed, or racial, economic, political and religious dominance... The GSW were motivated by a plethora of some of the most stupid people, waging wars from the stupidest crap imaginable. </p>\n</blockquote>\n<h3><br>Want to know more?</h3>\n<p><em>Keep reading we promise it's enlightening. </em><br><br><span style=\"text-decoration: underline;\">History is written by the victors,</span> or so they say. <br>But when a war decimates all beings capable of writing anything, and the victor is a toxic meteorite, then it's a bit difficult to find accurate report data to know what really happened. <br><br>The following is one of the few written documents ever found with <span style=\"text-decoration: line-through;\">trustworthy</span> information about what the Great Stupid Wars were all about.  <br><br>Not much is know about the author or the document. But it seems it was written by an 9th grader on the year HHHHHHHHH, as a mid term history assignment, right before the \"braindeads\" <em>(little zombie mutant things)</em> ran over the <span style=\"text-decoration: underline;\">\"New New Grant City\"</span> on Trinidad &amp; Tobago... home of the last known standing school in the world. <br><br>Still want to know more? <br><br>Go ahead and read or download the PDF. </p>\n<p><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"100%\" height=\"500px\" src=\"https://mudtowncrew.com/media/posts/4/Great-Stupid-Wars.pdf\"></iframe></div></p>\n<p> </p>",
            "image": "https://mudtowncrew.com/media/posts/4/P3.jpg",
            "author": {
                "name": "Federico Dib"
            },
            "tags": [
            ],
            "date_published": "2020-08-14T00:23:37-06:00",
            "date_modified": "2020-08-14T00:23:37-06:00"
        }
    ]
}
